{
  "blog": [
    {
      "id": "hh1",
      "title": "6 Times Deepika Padukone Blew Our Minds With Her Saree Looks",
      "description": "Deepika Padukone has always been a style maven. Her elegance and grace extend to every outfit of hers. When it comes to sarees, she takes it to another level. We have put together all those times when Deepika has blown our minds with her saree ensembles. This is your inspo for the upcoming wedding season and every saree look you are going to attempt here onwards.",
      "heading1": "The Classic Black and White",
      "heading2": "The Pearly White Fantasy",
      "description1": "If you are a basics kinda gal looking for a saree for the next festive occasion, look no further than this simple yet elegant black and white saree. Deepika Padukone seems to be loving halter neck blouses with her sarees, and we don’t seem to be loving it less either. She donned a white saree with a thin black sequin border and a plain white halter neck backless blouse with dainty tie-up details on the back. For earrings, she wore big square emerald stones with diamonds around it. She went bold with kajal for her eyes and a sleek bun to complete the look. This ensemble is fairly achievable for you and can be sported on various occasions – daytime weddings, receptions, and formal events.",
      "description2": "Deepika Padukone donned a custom Abu Jani Sandeep Khosla ensemble at Cannes and we just couldn’t get enough! It was an ivory chiffon saree with organza ruffles all along the border. For the blouse, she wore a silver embellished strapless blouse. However, the star element of the look was the Victorian-inspired collar made of pearls. She completed her look with heavily studded earrings and minimalistic makeup and her hair tied in a bun added to the elegance of the attire. You can achieve a look similar to this by pairing your ruffle sarees with an embellished cape or some surface-textured jewellery.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-banner-image.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-4.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-3.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-1.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-4.jpg",
      "date": "2025-05-19"
    },
    {
      "id": "0b93",
      "title": "Saree Engagement Looks That Scream Elegance and Glam",
      "description": "When it comes to the perfect engagement look in a saree, we’re channelling all the Bollywood drama and glam! Think Alia Bhatt in “2 States” or Deepika Padukone in “Chennai Express”, both draped in elegance, radiating charm and stealing every heart in the room. Sarees are timeless, but for your engagement, they deserve a dash of modern flair. From soft pastels to bold reds, the art of blending tradition and current trends for engagement sarees in brides is all about it.\n\nYou may be eyeing a shimmering silk or a breezy chiffon, but the right saree would make you feel the queen you are. Here is the engagement saree look idea that screams sophistication. So, whether it is a pre-wedding photoshoot or the big ring exchange moment, these engagement saree ideas will have you turning heads like a true Bollywood diva!",
      "heading1": "Traditional Silk Sarees For Engagement",
      "description1": "When it comes to the quintessential engagement look in a saree, nothing beats the regal charm of traditional silk sarees. Think Kanjeevaram, Banarasi, or Paithani sarees that radiate luxury and grace. Drape one in a rich jewel tone like emerald green or ruby red, and you’ll feel like a Bollywood bride straight out of a Sanjay Leela Bhansali film. Match it with traditional gold jewellery, a sleek bun adorned with fresh jasmine, and bold lips for an unforgettable classic vibe. Silk sarees are a timeless choice to da zle your guests and honour tradition.",
      "heading2": "Red Saree Ideas For Engagement",
      "description2": "Red is the colour of love, passion, and everything bridal! A red saree for your engagement look is a bold and stunning choice. Whether you go for a classic Banarasi silk or a modern georgette drape with sequin details, red will make sure all eyes are on you. Take inspiration from Ananya Panday and go for super straight hair paired with bold eye make-up, and a statement choker. Red sarees are perfect for making that dramatic entrance and setting the tone for your big day.\n\nGet The Look:\n\n",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-banner.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-2.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-1.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-2.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-4.jpg",
      "date": "2025-05-25"
    },
    {
      "id": "b730",
      "title": "Dress Like: You’re Taylor Swift On Stage",
      "description": "We are diving into the world of Taylor Swift outfits today, and we’re sure other Swifties like us are elated. She is not only a pop sensation – her music tops the charts all the time (the best-selling US album of a calendar year 6 times!) – but also a style icon. Her on-stage and off-stage looks have captured the hearts and imagination of fans and fashion enthusiasts alike.\n\nHer in-concert avatars reflect her artistic evolution and never fail to impress. Her personal fashion, too, has grown from country girl to chic pop star. She exudes glam and authenticity with her performance looks with a hint of her signature style. In this blog, we will delve into the ever-evolving world of Taylor Swift’s on-stage outfits, including her most memorable ensembles, which you can use as inspiration to give your wardrobe a twist of Taylor.\n\nWith the Taylor Swift movie coming up soon, the pop sensation has urged fans to dress up like it’s one of her concerts and keep the Swiftie spirit alive. So read ahead for an inspired guide to represent the tribe!",
      "heading1": "The Quintessential Taylor Look",
      "description1": "One of the first Taylor Swift songs I ever listened to and memorised the lyrics of was Love Story released in 2008. She wore this fit then, she is wearing it now and has been seen in this time and again at most of her concerts on-stage. It is a white graphic tee, sometimes with her lyrics on it, black shorts (glitter, leather, or denim), and her signature bucket hat. In the Swift-themed parties that you must be seeing all over social media, there is always someone dressed like this. It is easy to replicate indeed. Grab a white graphic tee, leather shorts, loafers, and a bucket hat. Don’t you forget her signature red lips! You’ve now got a Taylor-approved look in your closet that you can wear to a concert or as a costume for Halloween.\n\nGet the look:\n",
      "heading2": "Street-Style Swiftie",
      "description2": "Taylor has served some easy-going yet stunning looks in her Eras Tour and this is one of them. It’s quite simple and easy to replicate. All you need is a black sports bra and dusty green corduroy cargo pants. Yes, that’s about it. Of course, again, her signature red lips and bangs complete the look. You can wear this too, with a crop top or a spaghetti top instead of a sports bra. Wear it to run errands in style or just casually with friends. Try layering it up with a bomber jacket or a denim jacket. Throw on some sneakers underneath and carry a crossbody bag for the finishing touches. Is street style redefined by Taylor Swift? Because if it is, we are so into it!\n\nGet the look:",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-banner.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-4.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-4.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-7.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-10.jpg",
      "date": "2025-05-12"
    },
    {
      "id": "9d2c",
      "title": "Fashion Lessons Learnt From Alia Bhatt",
      "description": "Time and again, Indian cinema screens have been graced with flowy saree looks with immensely beautiful backdrops from snowcapped mountains to lush green fields. Sridevi, Anushka Sharma and Kajol have often adorned the big screen with statement saree looks with one constant beauty moment – the pallu hanging loosely and flowing in the air, making the movie-goers gasp WOW. It makes us want to dwell in classics, femininity and take pride in our country’s culture and cinema. These scenes and with them, their sartorial magic leave a major impact on the audience empowering their dreams and influencing looks in their daily life.\n\nAlia Bhatt has revived one such style – the chiffon saree era of Bollywood with the release of her latest movie only to make us realise the position of sarees in Bollywood’s storytelling. We have jotted down a few fashion lessons learnt from her that you can inculcate in your daily life or make a statement at an event that will only make heads turn.\n\nPlunging Neckline\nThe most noticed blouse style from the movie is the slightly deep plunging neckline with a minimal back. This blouse can not only be worn with sarees but lehengas also, and gives a flattering look. It outlines your neckline perfectly, and the saree beautifully breaks the two from the center. The combination of her sarees and blouses has created a harmonious balance of traditional Indian wear with modern fashion sensibilities. Manish Malhotra – the designer behind all of Alia’s looks in the movie, has played with different techniques that have made the plunging neckline with the saree even more beautiful.",
      "heading1": "Saree Patterns",
      "description1": "Designer and Costume Stylist, Manish Malhotra has experimented with modern techniques like colour blocking, paneling and ombre dyeing as well as traditional techniques such as leheriya and block printing while creating her sarees. The idea was to give her look a vintage film feel, full of drama and romance. This is your hint to bring back these styles and include them in your wardrobe.",
      "heading2": "Bright colours",
      "description2": "To keep it relevant to the young audience, lots of bright colours like pink, yellow and blue have been used in her sarees. You can see mixing and matching when it comes to colours like the neon green with purple saree look shot against a scenic backdrop of snow tips and blue sky. All her sarees perfectly harmonized with the scenic settings and that’s one lesson we have learnt from her.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/lessons-from-alia-0.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/lessons-from-alia-3.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/lessons-from-alia-3.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/lessons-from-alia-8.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/lessons-from-alia-12.jpg",
      "date": "2025-05-23"
    },
    {
      "id": "e418",
      "title": "From Wrap Dresses to Shirt Dresses: Here Are 12 Types of Dresses for You to Grab",
      "description": "One clothing item that’s both feminine and versatile is a dress. There is a huge variety of dresses in the market now, from different styles to different silhouettes and you can wear them for various occasions too. They are made in such a way that they fit different body types, occasions and moods. You can style them up according to your style and preferences.\n\nIn this blog, we have put together seven types of dresses for women, from the classic wrap dress to the formal shirt dress with tips to style them. Whether you are a fashion-forward individual or simply looking to make additions to your wardrobe, you are in the right place.\n\nWrap Dress\nWrap dresses speak vacation and you can never go wrong with them. They perfectly cinch your waist, and accentuate your curves giving you a flattering silhouette. You can find them in floral prints, colour blocking, abstract prints, solid colours, and geometric patterns. There is one out of these that completely wins our hearts and that is the floral wrap dress. It is the perfect summer dress, airy, light and bright. Wear it to the beach with a raffia hat and a matching tote bag. Or on a tropical vacation with tie-up flats and a mesh bag. You can also style it for brunch or wear it as casual wear too. Even for evening wear sometimes, like with nude heels and dainty accessories. The most suitable type of bag to go with this fit is the crossbody bag, after which comes the tote bag. Make sure you accessorise with cowrie shell hoops, layered necklaces and a stack of bracelets.",
      "heading1": "T-Shirt Dress",
      "description1": "Among all the dress types, a T-shirt dress is the most comfortable. They are effortless and classic and the perfect casual wear. They are basically oversized T-shirts that end right above the knee giving a relaxed fit. You will find them in cool graphics, typography, colour blocking, and solid colours. Chill at home in it or dress it up with a crossbody bag and some sneakers. Try picking bright colours for your bag such as orange, yellow, green and pink, this will elevate your look. Throw on some Y2K sunnies and tie your hair up in a high ponytail to complete the look. During winter, add a layer over your dress, be it a bomber jacket, denim jacket or a shirt for warmth. You can also add a belt to add structure and definition. Wear this dress to brunch, casual outings, run errands and wherever you want to be comfortable while looking good.",
      "heading2": "Midi Dress",
      "description2": "Midi dresses come between mini and maxi dresses. They fall right below the knee or come till mid-calf and exude sophistication. You can pick a printed piece for a daytime look or a velvet piece for a nighttime look. Wear a statement belt to cinch the waist creating a flattering silhouette. Team it up with pumps or stilettos and a handbag. You can add a blazer to wear to the office or add a shirt underneath to raise the style quotient.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/shirt-dresses-banner.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/shirt-dresses-6.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/shirt-dresses-5.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/shirt-dresses-7.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/shirt-dresses-8.jpg",
      "date": "2025-05-22"
    },
    {
      "id": "7243",
      "title": "2025 Style Forecast: Trendy Looks You Can Shop and Absolutely Slay Right Now",
      "description": "2025 has officially made its grand entrance, and with it comes a lineup of fashion trends destined to redefine your wardrobe game. While 2024 was all about diving deep into niche aesthetics—remember the office siren phase with its Bayonetta glasses, sharp button-downs, and mini pencil skirts straight out of The Devil Wears Prada? This year, though, is flipping the script. Forget tennis core and its preppy whites, sporty polos, and sneakers, or the acid-hued, leather-clad drama of Brat Summer.\n\nIt’s a year that will bring forth a combination of practicality and wow-factor flair. Ethereal ruffles, romantic lace, a fresh take on joggers that screams runway-ready, and – drumroll – the new “It” pink that might just dethrone Barbiecore, all make an appearance in the style moments of 2025. Personality-packed style moments are what 2025 is all about, feeling as wearable as they are inspiring.\n\nReady to revamp your wardrobe? We’ve curated the five biggest trends you’ll see everywhere this year—plus some irresistible pieces to shop now. Trust us, staying ahead of the fashion curve has never looked this good. Let’s get started.",
      "heading1": "Dusty Pink",
      "description1": "Barbiecore is officially out, and Dustycore is taking its place. The trend is all about soft, sophisticated pinks think ballet slippers, vintage rose petals, and that perfect blush of dawn. It’s understated elegance at its best, whispering chic instead of shouting. From flowy dresses to tailored suits and even joggers (yes, they’re still in), Dustycore adds effortless charm to every look. Pair it with creamy neutrals or metallics, and voilà – your wardrobe just got a major upgrade.",
      "heading2": "Soft Futurism",
      "description2": "The Y3K trend is serving intergalactic vibes, blending sleek metallics with the post-apocalyptic edge. Shiny silver pieces, like gleaming handbags and statement pants, are your ticket to the future. But it’s not all polished perfection – think deconstructed silhouettes and edgy, dystopian details that scream “fashion survivor”. Pair cargo pants with cool, sculptural tops for a look that’s equal parts utility and next-century chic. The future of fashion? It’s already here.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/ftl-banner.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/ftl-3.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/ftl-1.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/ftl-2.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/ftl-3.jpg",
      "date": "2025-05-25"
    },
    {
      "id": "99a5",
      "title": "7 Bags to BAG This Shaadi SZN",
      "description": "Shaadi season is a fun time to play dress-up. With vibrant colours of marigold and the best of Bollywood tunes blasting around us, we just can’t keep calm! The vibe, the food, the fashion – what’s not to love, right? Indian weddings are affairs of glamour – nothing short of a ramp walk! This grandeur is reflected in the attires of not just the bride and groom but also the attendees. From flared lehengas and anarkalis to opulent sarees and suit sets, all outfits are statement-making.\n\nWhen it comes to details, your accessories can add an interesting element as well as functionality to your outfit. And what better way to make a statement than with the perfect handbag, right? We are here with a carefully curated selection of bags and clutches that are sure to turn heads this shaadi season. Be it a crossbody bag, a structural bag, or a classic potli bag – there is one for each occasion and style. So, let’s get into it!",
      "heading1": "Blingy Box Bag",
      "description1": "It’s always a good idea to add some glam to your ensemble, especially when it’s festive time. This blingy structured box bag is a must-have in this case. Its shimmering surface and metallic accents can elevate your outfit to the next level. Next time you pick a bag, go for intricate embroidery or something covered in sequins – this will draw focus. You can either carry it in your hand or wear it as a cross-body. These bags are such that they will help you build your entire outfit around the accessory for a look that will stand out. It is a perfect choice for reception parties, cocktail events, and also main wedding events.",
      "heading2": "Pearl Potli Bag",
      "description2": "Potli bags were a thing of the past – but they have made a comeback. They exude a vintage charm that resonates with the spirit of traditional Indian weddings. Also, pearls are evergreen and the most versatile. This bag in particular adds a touch of sophistication to your look with embellishments embroidered on the luxurious velvet cloth. It has bits of gold, silver, and lots of white. It is an excellent choice for the bride’s closest friends and family. You can pair it with a delicate and elegant saree or an anarkali outfit for a classic touch. Carry it to a cocktail party or a daytime function, as it suits most festive events.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/bags-banner-Image.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/bags-6.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/bags-3.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/bags-6.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/bags-8.jpg",
      "date": "2025-05-25"
    },
    {
      "id": "8369",
      "title": "25 Matching Bride & Groom Outfits For Your Big Day",
      "description": "Planning a wedding is a beautiful journey. Among the most delightful parts of it is choosing the perfect outfits for the bride and groom. Bride and groom matching dresses are one of the current trends that depict unity and style on this special day. From elegant lehengas paired with matching sherwanis to contemporary gowns alongside chic suits, there are endless options. A perfectly coordinated wedding dress for the bride and groom it creates very nice visual harmony in pictures. It’s a symphony every couple would want to be a part of.",
      "heading1": "1. Classic Red and Ivory",
      "description1": "For a vintage look, the couple can choose a red bridal gown for the bride and an ivory-coloured sherwani for the groom. This bridal and groom-matching dress combination exudes elegance and sophistication along with the core tradition. The bride can use intricate lace or embroidery details while the groom’s sherwani can have a subtle blend of embellishments that accompany the bridal attire. We recommend the Persian red floral lehenga from Odette for the bride and an ivory sharp sherwani from Contrast by Parth for the groom.",
      "heading2": "2. Bold Red and Gold",
      "description2": "The bride can don a bridal lehenga in scarlet red which can be paired with a gold sherwanis for the groom. Heavy embroidery on the wedding attire of the bride and very simple yet dignified wedding attire for the groom in gold would make a stunning presentation. This epitomises the traditional aura associated with Indian weddings. Going for the heavily embellished organza lehenga from Riyaasat and for the groom a golden sherwani by Runit Gupta is a good option.",
      "mainImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2020/10/Artboard-2.1-1.jpg",
      "lattestImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2024/11/mbgo-7.jpg",
      "otherImage": "https://www.nykaafashion.com/style-files/wp-content/uploads/2024/11/mbgo-1.jpg",
      "otherImage2": "https://www.nykaafashion.com/style-files/wp-content/uploads/2024/11/mbgo-4.jpg",
      "otherImage3": "https://www.nykaafashion.com/style-files/wp-content/uploads/2024/11/mbgo-7.jpg",
      "date": "2025-05-24"
    }
  ],
  "review": [
    {
      "id": "abc1",
      "start": 5,
      "comment": "best Blog"
    }
  ],
  "slider": [
    {
      "id": "sds1",
      "image": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/08/10-Types-Of-Earrings-To-Add-To-Your-Jewellery-Box-Banner.jpg"
    },
    {
      "id": "sds3",
      "image": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/09/saree-looks-banner-image.jpg"
    },
    {
      "id": "sds2",
      "image": "https://www.nykaafashion.com/style-files/wp-content/uploads/2023/10/dress-like-taylor-banner.jpg"
    },
    {
      "id": "6e83",
      "image": "https://www.nykaafashion.com/style-files/wp-content/uploads/2025/01/engam-look-banner.jpg"
    }
  ]
}